; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-72)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b1)
    (on b1 b15)
    (on b15 b18)
    (on b18 b16)
    (on b16 b4)
    (on b4 b12)
    (on b12 b14)
    (on b14 b10)
    (on b10 b9)
    (on b9 b19)
    (on b19 b5)
    (on b5 b2)
    (on b2 b20)
    (on b20 b3)
    (on-table b3)
    (clear b17)
    (on b17 b8)
    (on b8 b6)
    (on-table b6)
    (clear b7)
    (on b7 b21)
    (on b21 b13)
    (on-table b13))
 (:goal (and 
(on-table b15)
(on-table b12)
(on-table b19)
(clear b20) (on-table b20)
(on b4 b19)
(on b11 b4)
))
)

; plan
1. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 0 of 7
2. (stack b11 b17)
   deleted: (clear b17) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b17)
   goals met: 0 of 7
3. (unstack b1 b15)
   deleted: (on b1 b15) (clear b1) (arm-empty)
   added: (holding b1) (clear b15)
   goals met: 0 of 7
4. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 7
5. (unstack b15 b18)
   deleted: (on b15 b18) (clear b15) (arm-empty)
   added: (holding b15) (clear b18)
   goals met: 0 of 7
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 7
7. (unstack b18 b16)
   deleted: (on b18 b16) (clear b18) (arm-empty)
   added: (holding b18) (clear b16)
   goals met: 1 of 7
8. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 7
9. (unstack b16 b4)
   deleted: (on b16 b4) (clear b16) (arm-empty)
   added: (holding b16) (clear b4)
   goals met: 1 of 7
10. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 7
11. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 1 of 7
12. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 1 of 7
13. (unstack b12 b14)
   deleted: (on b12 b14) (clear b12) (arm-empty)
   added: (holding b12) (clear b14)
   goals met: 1 of 7
14. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 7
15. (unstack b14 b10)
   deleted: (on b14 b10) (clear b14) (arm-empty)
   added: (holding b14) (clear b10)
   goals met: 2 of 7
16. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 7
17. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 2 of 7
18. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 7
19. (unstack b9 b19)
   deleted: (on b9 b19) (clear b9) (arm-empty)
   added: (holding b9) (clear b19)
   goals met: 2 of 7
20. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 7
21. (unstack b19 b5)
   deleted: (on b19 b5) (clear b19) (arm-empty)
   added: (holding b19) (clear b5)
   goals met: 2 of 7
22. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 3 of 7
23. (unstack b4 b1)
   deleted: (on b4 b1) (clear b4) (arm-empty)
   added: (holding b4) (clear b1)
   goals met: 3 of 7
24. (stack b4 b19)
   deleted: (clear b19) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b19)
   goals met: 4 of 7
25. (unstack b11 b17)
   deleted: (on b11 b17) (clear b11) (arm-empty)
   added: (holding b11) (clear b17)
   goals met: 4 of 7
26. (stack b11 b4)
   deleted: (clear b4) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b4)
   goals met: 5 of 7
27. (unstack b5 b2)
   deleted: (on b5 b2) (clear b5) (arm-empty)
   added: (holding b5) (clear b2)
   goals met: 5 of 7
28. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 7
29. (unstack b2 b20)
   deleted: (on b2 b20) (clear b2) (arm-empty)
   added: (holding b2) (clear b20)
   goals met: 6 of 7
30. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 7
31. (unstack b20 b3)
   deleted: (on b20 b3) (clear b20) (arm-empty)
   added: (holding b20) (clear b3)
   goals met: 5 of 7
32. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 7 of 7
